<?php

/*
  |--------------------------------------------------------------------------
  | 首页
  |--------------------------------------------------------------------------
  */
Route::get('/', 'IndexController@index');

/*
  |--------------------------------------------------------------------------
  | 登录注册
  |--------------------------------------------------------------------------
  */
Auth::routes();

/*
  |--------------------------------------------------------------------------
  |
  |--------------------------------------------------------------------------
  */
Route::get('/home', function(){
    return view("home");
})->name('home');

/*
  |--------------------------------------------------------------------------
  | 观点详情页面
  |--------------------------------------------------------------------------
  */
Route::get("detail/{id}" , 'DetailController@index'); //观点详情
Route::post('comment' , 'DetailController@comment');  //评论
Route::get('comment/page' , 'DetailController@page'); //获取评论内容
Route::post("collect" , 'DetailController@collect');  //收藏
Route::post("praise" , 'DetailController@praise');    //点赞

/*
  |--------------------------------------------------------------------------
  | 用户中心
  |--------------------------------------------------------------------------
  */
Route::any("user/index" , 'UserController@index'); //个人中心首页
Route::any("user/basicProfile" , 'UserController@basicProfile'); //显示基本资料
Route::any("user/city" , 'UserController@city'); //获取城市信息
Route::post("user/editFile" , 'UserController@editFile');  //编辑资料

/*
  |--------------------------------------------------------------------------
  | 用户中心----我的文章管理
  |--------------------------------------------------------------------------
  */
Route::any("articlelist" , 'ArticleManagerController@index'); //我的文章列表
Route::get("articleShow/{id?}" , 'ArticleManagerController@add'); //添加|编辑文章



/*
  |--------------------------------------------------------------------------
  | 上传公共方法
  |--------------------------------------------------------------------------
  */
Route::post("public/upload" , 'PublicController@upload'); //上传图片

/*
  |--------------------------------------------------------------------------
  | 上传公共方法
  |--------------------------------------------------------------------------
  */
Route::any('account/wxLogin'  , 'AccountController@wxLogin'); //微信登录
Route::get('account/wxResult' , 'AccountController@wxResult'); //微信登录